<template>
  <YuumiCascader :options="options" v-model="value" every placeholder="选择即变化"></YuumiCascader>
  <div>{{value}}</div>
</template>

<script>
export default {
  data () {
    return {
      value: null,
      options: [
        { "label": "战士", "value": "战士", "children": [
          { "label": "狂战士-奥拉夫", "value": "狂战士-奥拉夫" },
          { "label": "德邦总管-赵信", "value": "德邦总管-赵信" },
          { "label": "无畏战车-厄加特", "value": "无畏战车-厄加特" },
          { "label": "正义天使-凯尔", "value": "正义天使-凯尔" },
          { "label": "无极剑圣-易", "value": "无极剑圣-易" },
          { "label": "符文法师-瑞兹", "value": "符文法师-瑞兹" },
          { "label": "亡灵战车-塞恩", "value": "亡灵战车-塞恩" },
          { "label": "祖安怒兽-沃里克", "value": "祖安怒兽-沃里克" },
          { "label": "雪原双子-努努和威朗普", "value": "雪原双子-努努和威朗普" },
          { "label": "蛮族之王-泰达米尔", "value": "蛮族之王-泰达米尔" }
        ] },
        { "label": '法师', "value": '法师', "children": [
          { "label":"黑暗之女-安妮","value":"黑暗之女-安妮" },
          { "label":"正义巨像-加里奥","value":"正义巨像-加里奥" },
          { "label":"卡牌大师-崔斯特","value":"卡牌大师-崔斯特" },
          { "label":"诡术妖姬-乐芙兰","value":"诡术妖姬-乐芙兰" },
          { "label":"猩红收割者-弗拉基米尔","value":"猩红收割者-弗拉基米尔" },
          { "label":"远古恐惧-费德提克","value":"远古恐惧-费德提克" },
          { "label":"符文法师-瑞兹","value":"符文法师-瑞兹" },
          { "label":"众星之子-索拉卡","value":"众星之子-索拉卡" },
          { "label":"堕落天使-莫甘娜","value":"堕落天使-莫甘娜" },
          { "label":"时光守护者-基兰","value":"时光守护者-基兰" },
          { "label":"痛苦之拥-伊芙琳","value":"痛苦之拥-伊芙琳" },
          { "label":"死亡颂唱者-卡尔萨斯","value":"死亡颂唱者-卡尔萨斯" },
          { "label":"虚空恐惧-科加斯","value":"虚空恐惧-科加斯" },
          { "label":"殇之木乃伊-阿木木","value":"殇之木乃伊-阿木木" },
          { "label":"冰晶凤凰-艾尼维亚","value":"冰晶凤凰-艾尼维亚" },
          { "label":"琴瑟仙女-娑娜","value":"琴瑟仙女-娑娜" },
          { "label":"虚空行者-卡萨丁","value":"虚空行者-卡萨丁" },
          { "label":"风暴之怒-迦娜","value":"风暴之怒-迦娜" },
          { "label":"天启者-卡尔玛","value":"天启者-卡尔玛" },
          { "label":"邪恶小法师-维迦","value":"邪恶小法师-维迦" },
          { "label":"诺克萨斯统领-斯维因","value":"诺克萨斯统领-斯维因" },
          { "label":"不祥之刃-卡特琳娜","value":"不祥之刃-卡特琳娜" }
        ] },
        { "label": '刺客', "value": '刺客', "children": [
          { "label":"德邦总管-赵信","value":"德邦总管-赵信" },
          { "label":"诡术妖姬-乐芙兰","value":"诡术妖姬-乐芙兰" },
          { "label":"无极剑圣-易","value":"无极剑圣-易" },
          { "label":"迅捷斥候-提莫","value":"迅捷斥候-提莫" },
          { "label":"麦林炮手-崔丝塔娜","value":"麦林炮手-崔丝塔娜" },
          { "label":"蛮族之王-泰达米尔","value":"蛮族之王-泰达米尔" },
          { "label":"武器大师-贾克斯","value":"武器大师-贾克斯" },
          { "label":"痛苦之拥-伊芙琳","value":"痛苦之拥-伊芙琳" },
          { "label":"瘟疫之源-图奇","value":"瘟疫之源-图奇" },
          { "label":"恶魔小丑-萨科","value":"恶魔小丑-萨科" },
          { "label":"虚空行者-卡萨丁","value":"虚空行者-卡萨丁" },
          { "label":"刀锋舞者-艾瑞莉娅","value":"刀锋舞者-艾瑞莉娅" },
          { "label":"不祥之刃-卡特琳娜","value":"不祥之刃-卡特琳娜" },
          { "label":"永恒梦魇-魔腾","value":"永恒梦魇-魔腾" },
          { "label":"盲僧-李青","value":"盲僧-李青" },
          { "label":"暗夜猎手-薇恩","value":"暗夜猎手-薇恩" },
          { "label":"狂野女猎手-奈德丽","value":"狂野女猎手-奈德丽" },
          { "label":"不屈之枪-潘森","value":"不屈之枪-潘森" },
          { "label":"离群之刺-阿卡丽","value":"离群之刺-阿卡丽" },
          { "label":"虚空先知-玛尔扎哈","value":"虚空先知-玛尔扎哈" },
          { "label":"刀锋之影-泰隆","value":"刀锋之影-泰隆" },
          { "label":"放逐之刃-锐雯","value":"放逐之刃-锐雯" },
          { "label":"九尾妖狐-阿狸","value":"九尾妖狐-阿狸" },
          { "label":"潮汐海灵-菲兹","value":"潮汐海灵-菲兹" }
        ] },
        { "label": '坦克', "value": '坦克', "children": [
          { "label":"狂战士-奥拉夫","value":"狂战士-奥拉夫" },
          { "label":"正义巨像-加里奥","value":"正义巨像-加里奥" },
          { "label":"无畏战车-厄加特","value":"无畏战车-厄加特" },
          { "label":"牛头酋长-阿利斯塔","value":"牛头酋长-阿利斯塔" },
          { "label":"亡灵战神-赛恩","value":"亡灵战神-赛恩" },
          { "label":"祖安怒兽-沃里克","value":"祖安怒兽-沃里克" },
          { "label":"雪原双子-努努和威朗普","value":"雪原双子-努努和威朗普" },
          { "label":"炼金术士-辛吉德","value":"炼金术士-辛吉德" },
          { "label":"虚空恐惧-科加斯","value":"虚空恐惧-科加斯" },
          { "label":"殇之木乃伊-阿木木","value":"殇之木乃伊-阿木木" },
          { "label":"披甲龙龟-拉莫斯","value":"披甲龙龟-拉莫斯" },
          { "label":"祖安狂人-蒙多医生","value":"祖安狂人-蒙多医生" },
          { "label":"巨魔之王-特朗德尔","value":"巨魔之王-特朗德尔" },
          { "label":"蒸汽机器人-布里茨","value":"蒸汽机器人-布里茨" },
          { "label":"熔岩巨兽-墨菲特","value":"熔岩巨兽-墨菲特" },
          { "label":"扭曲树精-茂凯","value":"扭曲树精-茂凯" },
          { "label":"荒漠屠夫-雷克顿","value":"荒漠屠夫-雷克顿" },
          { "label":"德玛西亚皇子-嘉文四世","value":"德玛西亚皇子-嘉文四世" }
        ] },
        { "label": '射手', "value": '射手', "children": [
          { "label":"战争女神-希维尔","value":"战争女神-希维尔" },
          { "label":"迅捷斥候-提莫","value":"迅捷斥候-提莫" },
          { "label":"麦林炮手-崔丝塔娜","value":"麦林炮手-崔丝塔娜" },
          { "label":"赏金猎人-厄运小姐","value":"赏金猎人-厄运小姐" },
          { "label":"寒冰射手-艾希","value":"寒冰射手-艾希" },
          { "label":"瘟疫之源-图奇","value":"瘟疫之源-图奇" },
          { "label":"英勇投弹手-库奇","value":"英勇投弹手-库奇" },
          { "label":"皮城女警-凯特琳","value":"皮城女警-凯特琳" },
          { "label":"暗夜猎手-薇恩","value":"暗夜猎手-薇恩" },
          { "label":"探险家-伊泽瑞尔","value":"探险家-伊泽瑞尔" },
          { "label":"狂暴之心-凯南","value":"狂暴之心-凯南" },
          { "label":"深渊巨口-克格莫","value":"深渊巨口-克格莫" }
        ] },
        { "label": '辅助', "value": '辅助', "children": [
          { "label":"远古恐惧-费德提克","value":"远古恐惧-费德提克" },
          { "label":"正义天使-凯尔","value":"正义天使-凯尔" },
          { "label":"牛头酋长-阿利斯塔","value":"牛头酋长-阿利斯塔" },
          { "label":"众星之子-索拉卡","value":"众星之子-索拉卡" },
          { "label":"寒冰射手-艾希","value":"寒冰射手-艾希" },
          { "label":"堕落天使-莫甘娜","value":"堕落天使-莫甘娜" },
          { "label":"时光守护者-基兰","value":"时光守护者-基兰" },
          { "label":"冰晶凤凰-艾尼维亚","value":"冰晶凤凰-艾尼维亚" },
          { "label":"琴瑟仙女-娑娜","value":"琴瑟仙女-娑娜" },
          { "label":"风暴之怒-迦娜","value":"风暴之怒-迦娜" },
          { "label":"天启者-卡尔玛","value":"天启者-卡尔玛" },
          { "label":"瓦洛兰之盾-塔里克","value":"瓦洛兰之盾-塔里克" },
          { "label":"蒸汽机器人-布里茨","value":"蒸汽机器人-布里茨" },
          { "label":"发条魔灵-奥莉安娜","value":"发条魔灵-奥莉安娜" }
        ] }
      ]
    }
  }
}
</script>